/************************************************************************/
/* [function note]
   [list]
   用户名结构体，包含用户姓名、性别
   待扩展用户属性
/* [2016/3/14/22-lipengsong]                          	*/
/************************************************************************/
struct UserInfo
{
	CString str_UserName;
	CString str_UserSex;
};

/************************************************************************/
/* [function note]
   [list]
   枚举文件格式
   txt
   doc
   pdf……
/* [2016/3/14/22-lipengsong]                          	*/
/************************************************************************/
enum File_Extensions
{
	File_Err,
	File_Txt,
	File_Doc,
	File_Pdf,
};